app/controllers/project_controller.rb

	def destroy
		project = Project.find_by(id: params[:id])

		if project.destroy
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 4]]

	def createProject
		project = Project.new(name: params[:name],
			shortDescription: params[:shortDescription],
			longDescription: params[:longDescription],
			image: params[:image])

		if project.save
---
INSERT INTO "projects" ("name", "shortDescription", "image", "longDescription", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

	def updateProject
		project = Project.find(params[:id])

		if project.update(project_param)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "projects" SET "id" = $1, "longDescription" = $2, "updated_at" = $3 WHERE "projects"."id" = $4  [["id", 3], ["longDescription", "Check out the website through this link: https://scheduler-site.herokuapp.com/"], ["updated_at", "2022-09-22 01:33:05.945587"], ["id", 1]]